[
  ['“独生子女证”申报办理', '受理', '公元2019年12月22日', '绿灯'],
  ['出具贫困生证明', '审核', '公元2019年12月13日', '红灯'],
  ['办理生育服务证', ' 归档', '公元2019年12月25日', '绿灯'],
  ['残疾人补贴申报', ' 受理', '公元2019年12月13日', '红灯'],
  ['城乡居民基本养老保险退休办理', '归档', '公元2019年12月12日', '红灯'],
  ['城乡居民养老保险个人账户退保办理', '审核', '公元2019年12月17日', '黄灯'],
  ['农村村民低保对象申报', '归档', '公元2019年12月20日', '绿灯'],
  ['特困供养待遇申报', '受理', '公元2019年12月21日', '绿灯'],
  ['新农合、养老保险收缴', '归档', '公元2019年12月21日', '绿灯'],
  ['户口迁入迁出证明', '审核', '公元2019年12月23日', '绿灯'],
  ['社区矫正对象的帮教管理', '审核', '公元2019年12月26日', '绿灯'],
  ['回乡创业人员登记', '归档', '公元2019年12月13日', '红灯'],
  ['综治服务', '受理', '公元2019年12月26日', '绿灯'],
  ['农村危房改造申报', '归档', '公元2019年12月23日', '绿灯'],
  ['代党组织收取党费', '审核', '公元2019年12月24日', '绿灯'],
  ['办理《流动党员活动证》', '审核', '公元2019年12月24日', '绿灯'],
  [
    '对申请救助的困难党员提供相关证明材料',
    '受理',
    '公元2019年12月21日',
    '绿灯'
  ],
  ['审核、出具党员函调等相关证明', '归档', '公元2019年12月26日', '绿灯'],
  [
    '出具残疾人贫困、就业、康复等意见及证明',
    '受理',
    '公元2019年12月18日',
    '黄灯'
  ],
  ['组织适龄男性公民进行兵役登记', '审核', '公元2019年12月25日', '绿灯']
];
